---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldLocation
source: html/6d61b661-0b54-17d7-87ce-275b2270732f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldLocation Property

"Location"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldLocation { get; }
```